-- Sample data to populate the subscriptions table. Adjust or remove as needed.

INSERT INTO subscriptions (token_code, token_name, base_asset_name, asset_type, status, quantity, amount, request_count, start_date, end_date, issue_date)
VALUES
  ('STO202403200', '2024 파라리 캘리포니아 T 3호', '2014 파라리 캘리포니아 T 3호', '클래식자동차', '발행완료', 10000, 100000000, 1000, '2024-03-29', '2024-03-31', '2024-04-12'),
  ('STO20240630301', '바바리아 고급 오르 C38 2호', '바바리아 고급 오르 C38 2호', '보트', '청약진행중', 300000, 300000000, 40306, '2024-12-01', '2024-12-30', '2024-12-30'),
  ('STO2024032502', '아이타이즈빌딩 사무실임대', '아이타이즈빌딩 사무실임대', '사무실임대', '발행완료', 30000, 100000000, 21, '2024-03-20', '2024-03-25', '2024-03-25'),
  ('STO20240640401', '삭스도어 320GTC 1호', '삭스도어 320GTC 1호', '보트', '청약진행중', 20000, 200000000, 0, '2024-05-01', '2024-05-30', '2025-01-01'),
  ('STO2024032601', '2014 파라리 캘리포니아 T 2호', '2014 파라리 캘리포니아 T 2호', '클래식자동차', '발행완료', 10000, 100000000, 3500, '2024-03-26', '2024-03-27', '2024-03-29'),
  ('STO2024032502X', '기계장비 501호', '기계장비 501호', '사무실임대', '발행완료', 1000, 10000000, 100, '2024-03-25', '2024-03-25', '2024-03-28'),
  ('STO20240322501', '핫둘트 바바리카 2호', '핫둘트 바바리카 2호', '취차', '소각', 10000, 100000000, 1000, '2024-03-22', '2024-03-22', '2024-03-22'),
  ('STO20240325501', '기계장비 502호', '기계장비 502호', '사무실임대', '발행완료', 1000, 100000000, 1, '2024-03-25', '2024-03-25', '2024-03-28'),
  ('TKN00119091111', '아이타리아 1호', '아이타리아 1호', '장외주식', '소각', 50000000, 7500000000, 0, '2024-05-02', '2024-05-05', '2024-05-17'),
  ('STO2024032201', '파라리 칼리포리나 T 2014 1호', '2014 파라리 칼리포리나 T 1호', '클래식자동차', '청약준비중', 30000, 300000000, 2300, '2024-03-22', '2024-03-22', '2024-03-26');